In [52]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:80% !important;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.output {font-size:12pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-header{margin-top:150px;}
</style>
<style>
span.toc-item-num{
display:none;
}
</style>
"""))

# 9절. 데이터 그룹화 및 집계

In [136]:
import pandas as pd
import numpy as np
from statsmodels.api import datasets

In [ ]:
iris = datasets.get_rdataset('iris').data
iris.head(1)
iris.iloc[[0,49,50,99,100,149]]

## 9.1 group by
cf. pivot_table

In [ ]:
# 1)그룹화방법 1 :df.groupby(by=[그룹핑할열])[함수적용해서 적용할 열들].기초통계함수()
                # [함수적용해서 출력할 열들]:모든 열이 적용됨
iris_grouped = iris.groupby(iris.Species)
iris_grouped_sum = iris_grouped.sum()
iris_grouped_sum

In [ ]:
iris_grouped_sum.loc[['setosa','virginica']]

In [ ]:
print(iris_grouped_sum.columns)
print(iris_grouped_sum.index)

In [ ]:
iris_grouped_sum.reset_index(inplace=True) # index를 컬럼 데이터로 편입

In [ ]:
iris_grouped_sum

In [ ]:
# iris_grouped_sum에서 setosa 그룹함수 결과만 추출
iris_grouped_sum[iris_grouped_sum['Species']=='setosa']
iris_grouped_sum[iris_grouped_sum.Species=='setosa']
iris_grouped_sum.loc[iris_grouped_sum.Species=='setosa']

In [ ]:
# iris_grouped_sum에서 setosa와 virginica 그룹함수 결과만 추출
iris_grouped_sum[(iris_grouped_sum.Species=='setosa')|(iris_grouped_sum.Species=='virginica')]

In [ ]:
iris_grouped_sum[iris_grouped_sum.Species.isin(['setosa','virginica'])]

In [ ]:
# 1)그룹화방법 1.1 : 그룹핑할 때 index를 컬럼 데이터로 편입(reset_index가 필요 x)
#df.groupby(by=[그룹핑할열],as_index=False)[함수적용해서 적용할 열들].기초통계함수()
     # [함수적용해서 출력할 열들]:모든 열이 적용됨
iris.groupby(iris.Species, as_index=False).sum()

In [ ]:
# display(iris.groupby(iris.Species).sum())
display(iris.groupby(['Species']).sum())
#display(iris.groupby('Species').sum())

In [ ]:
# 종별 sepal.length와 sepal.width의 평균
# iris.groupby('Species').mean()[['Sepal.Length','Sepal.Width']]
iris.groupby('Species')[['Sepal.Length','Sepal.Width']].mean()

In [ ]:
# 종별 Sepal.Length 의 합계
iris.groupby('Species')['Sepal.Length'].sum() # 결과가 시리즈 (1차원)

In [ ]:
iris.groupby('Species')[['Sepal.Length']].sum() # 결과가 데이터 프레임

In [ ]:
# 2) 그룹화 방법 2
# df.pivot_table(index='그룹화할 필드',
#                values=['함수적용해서 출력할 열들'],
#                aggfunc='함수명(기본값:mean)')

iris.pivot_table(index='Species')#종별평균들

In [ ]:
#iris.groupby('Species')[['Sepal.Length','Sepal.Width']].sum()
iris.pivot_table(index='Species',
                values=['Sepal.Length','Sepal.Width'],
                 aggfunc='sum')

In [ ]:
iris.groupby('Species').count() # 결측치를 제외한 데이터 갯수

In [ ]:
iris.pivot_table(index='Species',
                aggfunc='count')# 결측치를 제외한 데이터 갯수

In [ ]:
import random
random.sample(range(len(iris)),3)

In [ ]:
iris.shape[1]-1 # iris의 독립변수 열 갯수

In [ ]:
# 각 열에 임의의 행에 결측치를 할당(0번째열은 결측치 1개, 1번째열은 결측치 2개, ... 3번째 열은 결측치 4개)
for col in range(iris.shape[1]-1):
    iris.iloc[random.sample(range(len(iris)),col+1),col] = np.nan

In [ ]:
iris.groupby('Species').count()

In [ ]:
result=iris.pivot_table(index='Species',
                aggfunc='count')
result=result[['Sepal.Length','Sepal.Width','Petal.Length','Petal.Width']]
result

In [ ]:
iris['Species'].value_counts() #종별 데이터 갯수

### 다중열로 그룹화

In [ ]:
iris.head(1)

In [ ]:
# iris로 다중열 그룹화 하기 위해서 데이터 추가(num 필드)
# iris의 행수가 150개 = Species 3그룹, num 6그룹
[[i]*25 for i in range(6)]

In [ ]:
import numpy as np
iris['num']= np.ravel([[i]*25 for i in range(6)])
iris.iloc[::10]

In [ ]:
# 종별, num별 합계
r = iris.groupby(by=['Species','num']).sum()
r

In [ ]:

r.index

In [ ]:
r.loc[['setosa','virginica']] # setosa와 virginica만 결과 추출

In [ ]:
# 종별, num별 중위수 ('Species','num'이 컬럼 데이터로 편입)
r = iris.groupby(by=['Species','num'], as_index=False).median()
r

In [ ]:
# setosa와 virginica 추출
r[(r['Species']=='setosa')|(r['Species']=='virginica')]
r[r['Species'].isin(['setosa','virginica'])]

In [ ]:
# iris.groupby(by=['Species','num']).sum 과 동일
iris.pivot_table(index=['Species','num'],
                #values=[],
                aggfunc='sum')

In [ ]:
# 종별 기초 통계량(min,max,count,mean,median,Q1,Q3,sed...)모두
iris.groupby(['Species']).describe()

In [ ]:
iris.groupby(['Species']).describe().T

In [ ]:

g= iris.groupby(['Species'])[['Sepal.Length','Sepal.Width','Petal.Length','Petal.Width']].mean()

g

https://stackoverflow.com/questions/30490740/move-legend-outside-figure-in-seaborn-tsplot: 범례사용

In [ ]:
import matplotlib.pyplot as plt
g.plot(kind='bar',figsize=(10,3))
plt.legend(bbox_to_anchor=(1.01,1),loc=2,borderaxespad=0.)

In [ ]:
# 종별,num별 평균
g = iris.groupby(['Species','num']).mean()
g

In [ ]:
# g의 level0 인덱스만 그대로 두고, level1인덱스를 컬럼값으로 올려
g.unstack().T

In [ ]:
g.plot(kind='box',figsize=(10,5))
plt.show()

## 9.2 그룹간 데이터 처리

In [ ]:
iris_grouped = iris.groupby('Species')
iris_grouped

In [ ]:
for speciename, group in iris_grouped:
    print(speciename)
    print(group.head(3))
    print('■■■■■■■■■■■■■■■■■■■■■')

In [ ]:
# 종별 임의의 표본 5개씩 출력
# iris.sample(5).sort_index()
for idx, (speciename,group) in enumerate(iris_grouped):
    print('{}번째 그룹은{}'.format(idx,speciename))
    display(group.sample(5).sort_index())

In [ ]:
# 종별  0,10,20,30,40번째 데이터 출력: s:10,20,30,40행, vc:50,60,70,80,90, vn:100,110
for speciename,group in iris_groupby('Species'):
    print(speciename,'그룹')
    print(group.iloc[[0,10,20,30,40]])

## 9.4 레이블(원핫인코딩)

In [ ]:
iris.drop('num',axis=1, inplace=True)

In [ ]:
iris.head()

In [ ]:
# 레이블(원핫인코딩)을 지원하는 패키지 이용
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder() # 객체
iris['target'] = le.fit_transform(iris.Species)
iris.iloc[::25]

# 10절. 데이터 구조 변경
## 10.1 와이드포맷<->롱포맷
- 판다스 공식문서에 나오는melt:https://pandas.pydata.org/docs/user_guide/reshaping.html#reshaping-by-melt

- [Tidy Data 란?](https://vita.had.co.nz/papers/tidy-data.pdf ) 7page

In [20]:
import statsmodels.api as sm
airqulity = sm.datasets.get_rdataset('airquality',package='datasets').data
airqulity

     Ozone  Solar.R  Wind  Temp  Month  Day
0     41.0    190.0   7.4    67      5    1
1     36.0    118.0   8.0    72      5    2
2     12.0    149.0  12.6    74      5    3
3     18.0    313.0  11.5    62      5    4
4      NaN      NaN  14.3    56      5    5
..     ...      ...   ...   ...    ...  ...
148   30.0    193.0   6.9    70      9   26
149    NaN    145.0  13.2    77      9   27
150   14.0    191.0  14.3    75      9   28
151   18.0    131.0   8.0    76      9   29
152   20.0    223.0  11.5    68      9   30

[153 rows x 6 columns]

## 10.2 melt를 이용한 언피벗팅(와이드포맷->롱포맷)

In [21]:
airqulity_melted= airqulity.melt(id_vars=['Month','Day'])
airqulity_melted

     Month  Day variable  value
0        5    1    Ozone   41.0
1        5    2    Ozone   36.0
2        5    3    Ozone   12.0
3        5    4    Ozone   18.0
4        5    5    Ozone    NaN
..     ...  ...      ...    ...
607      9   26     Temp   70.0
608      9   27     Temp   77.0
609      9   28     Temp   75.0
610      9   29     Temp   76.0
611      9   30     Temp   68.0

[612 rows x 4 columns]

In [22]:
airqulity_melted=airqulity.melt(id_vars=['Month','Day'], 
               var_name='변수명',# melt된 열의 이름
               value_name='값') # 데이터가 된 열의 이름
airqulity_melted.sort_values(by=['Month','Day'])
airqulity_melted.reset_index()

     index  Month  Day    변수명     값
0        0      5    1  Ozone  41.0
1        1      5    2  Ozone  36.0
2        2      5    3  Ozone  12.0
3        3      5    4  Ozone  18.0
4        4      5    5  Ozone   NaN
..     ...    ...  ...    ...   ...
607    607      9   26   Temp  70.0
608    608      9   27   Temp  77.0
609    609      9   28   Temp  75.0
610    610      9   29   Temp  76.0
611    611      9   30   Temp  68.0

[612 rows x 5 columns]

### melt 연습하기

In [1]:
import pandas as pd
df_first = pd.read_csv(r'D:\ai\Downloads\shareData\전국 평균 평당 분양가격(2013년 9월부터 2015년 8월까지).csv',encoding='cp949')
df_last = pd.read_csv(r'D:\ai\Downloads\shareData\주택도시보증공사_전국 신규 민간아파트 분양가격 동향_20240731.csv',encoding='cp949')
df_first.shape, df_last.shape

((17, 22), (9010, 5))

In [2]:
df_first.head(5) # => new_first(지역명, 연도, 월, 평당분양가격(제곱미터))

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581
2,대구,8080,8080,8077,8101,8267,8274,8360,8360,8370,...,8439,8253,8327,8416,8441,8446,8568,8542,8542,8795
3,인천,10204,10204,10408,10408,10000,9844,10058,9974,9973,...,10020,10020,10017,9876,9876,9938,10551,10443,10443,10449
4,광주,6098,7326,7611,7346,7346,7523,7659,7612,7622,...,7752,7748,7752,7756,7861,7914,7877,7881,8089,8231

In [3]:
df_last.head(1) # => new_last(모든 면적 행만 지역명,연도 , 월,분양가격(제곱미터))

  지역명  규모구분    연도   월 분양가격(제곱미터)
0  서울  모든면적  2015  10       5841

In [4]:
# 지역 연도 월 평당분양가격 식의 롱포맷 데이터로 바꾸기
new_first=df_first.melt(id_vars=['지역'],
             var_name='연도월',
             value_name='평당분양가격')
new_first.sample(1)

     지역      연도월  평당분양가격
303  경북  2015년5월    6966

In [5]:
# 연도월 컬럼을 연도, 월로 분리 
def parse_year(x):
    return int(x.split('년')[0])
parse_year("2013년12월")

2013

In [6]:
# new_first['연도월'].map(lambda x : int(x.split('년')[0])) #map은 1차원에서 가능
new_first['연도']=new_first['연도월'].apply(lambda x : int(x.split('년')[0])) # apply는 1,2차원 모두 가능
new_first.head(1)

   지역       연도월  평당분양가격    연도
0  서울  2013년12월   18189  2013

In [7]:
new_first['월']=new_first['연도월'].apply(lambda x : int(x.split('년')[-1][:-1]))
new_first.head(1)

   지역       연도월  평당분양가격    연도   월
0  서울  2013년12월   18189  2013  12

In [8]:
# 평당분양가격/3.3 => 분양가격(제곱미터)
new_first.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역      357 non-null    object
 1   연도월     357 non-null    object
 2   평당분양가격  357 non-null    int64
 3   연도      357 non-null    int64
 4   월       357 non-null    int64
dtypes: int64(3), object(2)
memory usage: 14.1+ KB

In [9]:
new_first['분양가격(제곱미터)'] = new_first['평당분양가격']/3.3
new_first.sample(1)

     지역      연도월  평당분양가격    연도  월   분양가격(제곱미터)
225  광주  2015년1월    7752  2015  1  2349.090909

In [12]:
# 불필요한 필드 삭제, column명을 지역 -> 지역명
new_first.drop(['연도월','평당분양가격'],axis=1,inplace=True)
new_first.columns=['지역명','연도','월','분양가격(제곱미터)']
new_first.head()

  지역명    연도   월   분양가격(제곱미터)
0  서울  2013  12  5511.818182
1  부산  2013  12  2457.878788
2  대구  2013  12  2448.484848
3  인천  2013  12  3092.121212
4  광주  2013  12  1847.878788

In [14]:
#df_last => new_last(모든 면적 행만 지역명,연도 , 월,분양가격(제곱미터))
new_last = df_last[df_last['규모구분']=='모든면적']
new_last.head(1)

  지역명  규모구분    연도   월 분양가격(제곱미터)
0  서울  모든면적  2015  10       5841

In [15]:
# new_last의 규모 구분 열 삭제
new_last.drop('규모구분', axis=1)

     지역명    연도   월 분양가격(제곱미터)
0     서울  2015  10       5841
5     인천  2015  10       3163
10    경기  2015  10       3138
15    부산  2015  10       3112
20    대구  2015  10       2682
...   ..   ...  ..        ...
8985  전북  2024   7       3645
8990  전남  2024   7       3970
8995  경북  2024   7       4190
9000  경남  2024   7       4033
9005  제주  2024   7       7316

[1802 rows x 4 columns]

In [17]:
new_last.head(1)

  지역명  규모구분    연도   월 분양가격(제곱미터)
0  서울  모든면적  2015  10       5841

In [18]:
df = pd.concat([new_first,new_last])
df.head()

  지역명    연도   월   분양가격(제곱미터) 규모구분
0  서울  2013  12  5511.818182  NaN
1  부산  2013  12  2457.878788  NaN
2  대구  2013  12  2448.484848  NaN
3  인천  2013  12  3092.121212  NaN
4  광주  2013  12  1847.878788  NaN

## 10.3 pivot_table을 이용한 피벗팅(롱포맷->와이드포맷)

In [26]:
airqulity_melted= airqulity.melt(id_vars=['Month','Day'])
airqulity_melted=airqulity_melted.sort_values(['Month','Day']).reset_index(drop=True)
airqulity_melted.head()

   Month  Day variable  value
0      5    1    Ozone   41.0
1      5    1  Solar.R  190.0
2      5    1     Wind    7.4
3      5    1     Temp   67.0
4      5    2    Ozone   36.0

In [36]:
airqulity2 =airqulity_melted.pivot_table(index=['Month','Day'],
                            columns=['variable'],
                            values=['value'])
airqulity2.head()

          value
variable  Ozone Solar.R  Temp  Wind
Month Day
5     1    41.0   190.0  67.0   7.4
      2    36.0   118.0  72.0   8.0
      3    12.0   149.0  74.0  12.6
      4    18.0   313.0  62.0  11.5
      5     NaN     NaN  56.0  14.3

In [37]:
airqulity2.reset_index(level=['Month','Day'],col_level=1,inplace=True)
airqulity2.head()

                   value
variable Month Day Ozone Solar.R  Temp  Wind
0            5   1  41.0   190.0  67.0   7.4
1            5   2  36.0   118.0  72.0   8.0
2            5   3  12.0   149.0  74.0  12.6
3            5   4  18.0   313.0  62.0  11.5
4            5   5   NaN     NaN  56.0  14.3

In [38]:
airqulity2.columns=airqulity2.columns.droplevel(level=0) # 0번 level의 컬럼 제거
airqulity2.head()

variable  Month  Day  Ozone  Solar.R  Temp  Wind
0             5    1   41.0    190.0  67.0   7.4
1             5    2   36.0    118.0  72.0   8.0
2             5    3   12.0    149.0  74.0  12.6
3             5    4   18.0    313.0  62.0  11.5
4             5    5    NaN      NaN  56.0  14.3

In [42]:
airqulity2.columns.name=''
airqulity2.head(1)

   Month  Day  Ozone  Solar.R  Temp  Wind
0      5    1   41.0    190.0  67.0   7.4

### pivot_table(),pivot() 함수차이

In [45]:
import numpy as np
year = [2020]*3+[2021]*3
mon = [1,2,3] *2
latte=[410,401,402,400,404,405]
americano=[500,483,484,470,486,488]
mocha=[350,299,300,301,302,300]
sales = pd.DataFrame(np.c_[year,mon,latte,americano,mocha],
                    columns=['year','mon','latte','americano','mocha'])
sales

   year  mon  latte  americano  mocha
0  2020    1    410        500    350
1  2020    2    401        483    299
2  2020    3    402        484    300
3  2021    1    400        470    301
4  2021    2    404        486    302
5  2021    3    405        488    300

In [46]:
sales.groupby(['year'])[['latte','americano','mocha']].sum()

      latte  americano  mocha
year
2020   1213       1467    949
2021   1209       1444    903

In [47]:
result = sales.pivot_table(index='year',
                 values=['latte','americano','mocha'],
                 aggfunc='sum')
result

      americano  latte  mocha
year
2020       1467   1213    949
2021       1444   1209    903

In [48]:
result.loc[2021]

americano    1444
latte        1209
mocha         903
Name: 2021, dtype: int32

In [50]:
# pivot()
sales = sales.loc[:,'year':'latte']
sales

   year  mon  latte
0  2020    1    410
1  2020    2    401
2  2020    3    402
3  2021    1    400
4  2021    2    404
5  2021    3    405

In [51]:
sales.pivot(index='year',columns='mon')

     latte
mon      1    2    3
year
2020   410  401  402
2021   400  404  405

# 11절. 데이터프레임에 함수 적용시키기
- apply: (데이터프레임이나 시리즈 모두 적용가능)
- applymap(func): 각 요소별로 함수를 적용(데이터 프레임에서만 가능)
- map(func): 각 요소별로 함수를 적용(1차원시리즈에서만 가능)

## 11.1 apply

In [59]:
# ex1. 1차원 시리즈에서 사용
member = pd.read_csv('data/ch12_member.csv', comment='#')

In [60]:
def get_month(str):
    return int(str.split('-')[1])
get_month('2000-01-01')

1

In [61]:
member[member['Birth'].apply(lambda str : int(str.split('-')[1])) ==1]

  Name  Age      Email Address       Birth
0  홍길동   20  hong@hong  서울시강동구  1999-01-01

In [62]:
# ex2. 2차원 데이터 프레임에 apply적용 (axis)
df_last

     지역명                     규모구분    연도   월 분양가격(제곱미터)
0     서울                     모든면적  2015  10       5841
1     서울            전용면적 60제곱미터이하  2015  10       5652
2     서울   전용면적 60제곱미터초과 85제곱미터이하  2015  10       5882
3     서울  전용면적 85제곱미터초과 102제곱미터이하  2015  10       5721
4     서울           전용면적 102제곱미터초과  2015  10       5879
...   ..                      ...   ...  ..        ...
9005  제주                     모든면적  2024   7       7316
9006  제주            전용면적 60제곱미터이하  2024   7        NaN
9007  제주   전용면적 60제곱미터초과 85제곱미터이하  2024   7       7119
9008  제주  전용면적 85제곱미터초과 102제곱미터이하  2024   7        NaN
9009  제주           전용면적 102제곱미터초과  2024   7       7746

[9010 rows x 5 columns]

In [63]:
df_last.loc[0]

지역명             서울
규모구분          모든면적
연도            2015
월               10
분양가격(제곱미터)    5841
Name: 0, dtype: object

In [65]:
def year_month(series):
    return str(series['연도'])+'년'+str(series['월'])+'월'
year_month(df_last.loc[0])

'2015년10월'

In [67]:
df_last['연도월']\
    =df_last.apply(lambda series :str(series['연도'])+'년'+str(series['월'])+'월',axis=1)
df_last.head(1)

  지역명  규모구분    연도   월 분양가격(제곱미터)       연도월
0  서울  모든면적  2015  10       5841  2015년10월

In [79]:
# ex3 iris 데이터의 apply
import seaborn as sns
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [80]:
X= iris.iloc[:,:-1]
X.head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [81]:
X.apply(np.sum,axis=0) #열별 sum

sepal_length    876.5
sepal_width     458.6
petal_length    563.7
petal_width     179.9
dtype: float64

In [82]:
X.apply(np.sum, axis=1) # 행별 sum

0      10.2
1       9.5
2       9.4
3       9.4
4      10.2
       ...
145    17.2
146    15.7
147    16.7
148    17.3
149    15.8
Length: 150, dtype: float64

In [83]:
# X의 열별 평균 
avg = X.apply(np.average,axis =0)
avg

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [86]:
X.apply(lambda x : round(x-avg,2), axis=1)

     sepal_length  sepal_width  petal_length  petal_width
0           -0.74         0.44         -2.36         -1.0
1           -0.94        -0.06         -2.36         -1.0
2           -1.14         0.14         -2.46         -1.0
3           -1.24         0.04         -2.26         -1.0
4           -0.84         0.54         -2.36         -1.0
..            ...          ...           ...          ...
145          0.86        -0.06          1.44          1.1
146          0.46        -0.56          1.24          0.7
147          0.66        -0.06          1.44          0.8
148          0.36         0.34          1.64          1.1
149          0.06        -0.06          1.34          0.6

[150 rows x 4 columns]

In [87]:
X.apply(lambda x : list(round(x-avg,2)), axis=1)

0       [-0.74, 0.44, -2.36, -1.0]
1      [-0.94, -0.06, -2.36, -1.0]
2       [-1.14, 0.14, -2.46, -1.0]
3       [-1.24, 0.04, -2.26, -1.0]
4       [-0.84, 0.54, -2.36, -1.0]
                  ...
145       [0.86, -0.06, 1.44, 1.1]
146       [0.46, -0.56, 1.24, 0.7]
147       [0.66, -0.06, 1.44, 0.8]
148        [0.36, 0.34, 1.64, 1.1]
149       [0.06, -0.06, 1.34, 0.6]
Length: 150, dtype: object

## 11.2 applymap

In [88]:
X.applymap(np.round)

     sepal_length  sepal_width  petal_length  petal_width
0             5.0          4.0           1.0          0.0
1             5.0          3.0           1.0          0.0
2             5.0          3.0           1.0          0.0
3             5.0          3.0           2.0          0.0
4             5.0          4.0           1.0          0.0
..            ...          ...           ...          ...
145           7.0          3.0           5.0          2.0
146           6.0          2.0           5.0          2.0
147           6.0          3.0           5.0          2.0
148           6.0          3.0           5.0          2.0
149           6.0          3.0           5.0          2.0

[150 rows x 4 columns]

In [89]:
X.applymap(lambda x :x**2)

     sepal_length  sepal_width  petal_length  petal_width
0           26.01        12.25          1.96         0.04
1           24.01         9.00          1.96         0.04
2           22.09        10.24          1.69         0.04
3           21.16         9.61          2.25         0.04
4           25.00        12.96          1.96         0.04
..            ...          ...           ...          ...
145         44.89         9.00         27.04         5.29
146         39.69         6.25         25.00         3.61
147         42.25         9.00         27.04         4.00
148         38.44        11.56         29.16         5.29
149         34.81         9.00         26.01         3.24

[150 rows x 4 columns]

In [93]:
# ex1. 1차원 시리즈에서 사용
member = pd.read_csv('data/ch12_member.csv', comment='#')
member.head(1)

  Name  Age      Email Address       Birth
0  홍길동   20  hong@hong  서울시강동구  1999-01-01

In [95]:
member['Birth'].map(lambda date_str : int(date_str.split('-')[1]))

0     1
1    12
2    11
3    11
4     4
Name: Birth, dtype: int64

# 12절. 데이터 일괄 변경하기(결측치나 특정값)
## 12.1 fillna(결측치를  어떤 값으로 바꿈)
- 대부분의 결측치는 drop하거나, 평균값대체, 최빈값대체, 중위수대체, 그룹별 평균값, 이전값으로 대체, 다음값으로 대체, 회귀식결과 값으로 대체함

In [98]:
df = pd.DataFrame([[np.nan,2,np.nan,0],
                  [3,     4,np.nan,1],
                  [np.nan,3,np.nan,5],
                  [np.nan,3,np.nan,4]],
                 columns=list('ABCD'))
df

     A  B   C  D
0  NaN  2 NaN  0
1  3.0  4 NaN  1
2  NaN  3 NaN  5
3  NaN  3 NaN  4

In [99]:
# 모든 결측치를 무조건 0으로 대체
df.fillna(0)

     A  B    C  D
0  0.0  2  0.0  0
1  3.0  4  0.0  1
2  0.0  3  0.0  5
3  0.0  3  0.0  4

In [100]:
# 결측치를 이전행의 값으로 대체
df.fillna(method='ffill')

     A  B   C  D
0  NaN  2 NaN  0
1  3.0  4 NaN  1
2  3.0  3 NaN  5
3  3.0  3 NaN  4

In [103]:
# 결측치를 다른행의 값으로 대체
df.fillna(method='bfill')

     A  B   C  D
0  3.0  2 NaN  0
1  3.0  4 NaN  1
2  NaN  3 NaN  5
3  NaN  3 NaN  4

In [104]:
# 결측치를 특정 대체값으로 바꿈
values = {'A':99,'B':98,'C':97,'D':96}
df.fillna(value=values)

      A  B     C  D
0  99.0  2  97.0  0
1   3.0  4  97.0  1
2  99.0  3  97.0  5
3  99.0  3  97.0  4

In [105]:
#결측치를 열별 평균으로 바꿈
df.fillna(value=df.mean(axis=0))

     A  B   C  D
0  3.0  2 NaN  0
1  3.0  4 NaN  1
2  3.0  3 NaN  5
3  3.0  3 NaN  4

In [107]:
df.fillna(value=values, limit =3) # 결측치 대체는 3번째 행까지만)

      A  B     C  D
0  99.0  2  97.0  0
1   3.0  4  97.0  1
2  99.0  3  97.0  5
3  99.0  3   NaN  4

## 12.2 replace(to_value,new_value, inplace=T/F
- to_value를 new_value로 변경
- 정규표현식을 이용가능

In [111]:
s = pd.Series([0,1,2,3,None])
s.replace(np.nan,0, inplace= True)
s.replace([0,1],99) # 0이나 1을 99로 변경

0    99.0
1    99.0
2     2.0
3     3.0
4    99.0
dtype: float64

In [ ]:
s = pd.Series([0,1,2,3,None])
s

In [113]:
df = pd.DataFrame({'A':['bat','foo','bait'],
                 'b':['abc','bar','xyz']})

In [114]:
df.replace(r'^ba.+$','xxx',regex=True)

     A    b
0  xxx  abc
1  foo  xxx
2  xxx  xyz

In [116]:
df.replace({'A':'bat','B':'abc'},'XXX')

      A    b
0   XXX  abc
1   foo  bar
2  bait  xyz

## 12.3 where(조건),mask(조건)
    - where(조건): 조건이 만족하는 요소는 그대로 출력하고 만족하지 않는 요소는 결측치로
    - mask(조건): where와의 반대

In [117]:
s = pd.Series(range(10,20))
s

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [118]:
s[s>15]# 15초과값 출력

6    16
7    17
8    18
9    19
dtype: int64

In [119]:
s.where(s>15) # 조건이 만족되는 데이터는 그대로 출력. 만족되지 않은 데이터는 결측치

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6    16.0
7    17.0
8    18.0
9    19.0
dtype: float64

In [120]:
s.mask(s>15)

0    10.0
1    11.0
2    12.0
3    13.0
4    14.0
5    15.0
6     NaN
7     NaN
8     NaN
9     NaN
dtype: float64

## 12.4 dropna
- 결측치가 있는 데이터 누락 (행기준, 열기준)

In [122]:
df= pd.DataFrame({'name':['홍','김','이',np.nan],
                 'age':[np.nan,20,30,np.nan],
                 'born':['서울','부산',np.nan,np.nan]})
df

  name   age born
0    홍   NaN   서울
1    김  20.0   부산
2    이  30.0  NaN
3  NaN   NaN  NaN

In [124]:
df.dropna() # 결측치가 하나라도 있는 행은 제거 inplace=True가 아니면 return

  name   age born
1    김  20.0   부산

In [125]:
df.dropna(subset=['name','age'])#name열과 age열에 결측치가 하나라도 있는 행 제거

  name   age born
1    김  20.0   부산
2    이  30.0  NaN

In [129]:
df.dropna(how='all') # 모두 결측치인 행만 삭제

  name   age born
0    홍   NaN   서울
1    김  20.0   부산
2    이  30.0  NaN

In [132]:
df.dropna(axis=1) #결측치가 하나라도 있으면 삭제

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [133]:
df.dropna(axis=1,how='all') # 모두 결측치인 열만 삭제

  name   age born
0    홍   NaN   서울
1    김  20.0   부산
2    이  30.0  NaN
3  NaN   NaN  NaN

## 12절 연습문제

In [144]:
import random
print(random.sample(range(150),20))

[34, 142, 97, 103, 86, 24, 4, 108, 125, 119, 1, 91, 148, 76, 68, 122, 107, 126, 144, 146]

In [145]:
iris = datasets.get_rdataset('iris').data
iris

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [151]:
# 1단계
for col in range(iris.shape[1]-1):
    iris.iloc[random.sample(range(len(iris)),col+1),col] = np.nan
iris

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           NaN          1.8  virginica

[150 rows x 5 columns]

In [153]:
#2단계 
iris.isna().sum()

Sepal.Length    1
Sepal.Width     2
Petal.Length    3
Petal.Width     4
Species         0
dtype: int64

In [154]:
iris['Sepal.Length'].isna()

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: Sepal.Length, Length: 150, dtype: bool